Repository: quarkusio/cn.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en
Languages: zh_cn

source: Writing REST Services Reference
zh_cn: 编写REST服务参考

source: Writing Simple CRUD Applications with Spring Data
zh_cn: 用Spring Data编写简单的CRUD应用程序

source: Writing Simple REST CRUD Services
zh_cn: 编写简单的REST CRUD服务

source: Writing Your Own Extension
zh_cn: 编写您自己的扩展

source: Writing a Codestart for an extension
zh_cn: 为扩展编写Codestart

source: Writing a JAX-RS resource
zh_cn: 编写一个JAX-RS资源

source: Writing a Profile
zh_cn: 编写Profile

source: Writing a blog
zh_cn: 写博客

source: Writing entities managed by Hibernate Reactive to Kafka
zh_cn: 将Hibernate Reactive管理的实体写入Kafka中

source: Writing entities managed by Hibernate to Kafka
zh_cn: 将Hibernate管理的实体写入Kafka中

source: Writing the application
zh_cn: 编写应用程序

source: Writing to Kafka from an HTTP endpoint
zh_cn: 从HTTP节点写消息到Kafka

source: Wrong. + First off, just disable the transaction by marking your transaction boundary with `@Transactional(NOT_SUPPORTED)` (or `NEVER` or `SUPPORTS` depending on the semantic you want). + Second, it's again fairy tale that not using transaction is faster. The answer is, it depends on your DB and how many SQL SELECTs you are making. No transaction means the DB does have a single operation transaction context anyways. + Third, when you do several SELECTs, it's better to wrap them in a single transaction because they will all be consistent with one another. Say your DB represents your car dashboard, you can see the number of kilometers remaining and the fuel gauge level. By reading it in one transaction, they will be consistent. If you read one and the other from two different transactions, then they can be inconsistent. It can be more dramatic if you read data related to rights and access management for example.
zh_cn: 错误。 + 首先，只要用 `@Transactional(NOT_SUPPORTED)` （或 `NEVER` 或 `SUPPORTS` ，取决于你想要的语义）标记你的事务边界，就可以禁用事务。 + 其次，不使用事务会更快，这又是另一个故事。答案是，这取决于你的数据库和你正在进行的SQL SELECT的数量。不使用事务意味着无论如何，数据库确实有一个单一的操作事务环境。 + 第三，当你做几个SELECT时，最好把它们包在一个事务中，因为它们都会保持一致性。假设你的数据库代表你的汽车仪表盘，你可以看到剩余的公里数和油表水平。通过在一个事务中读取它，它们将是一致的。如果你从两个不同的事务中读取一个和另一个，那么它们可能是不一致的。再例如，如果你读取与权限和访问管理有关的数据，结果可能会更加戏剧化。

source: XCode provides the required dependencies on macOS:
zh_cn: XCode在macOS上提供了必要的依赖性：

source: YAML `null` keys are not included in the assembly of the configuration property name, allowing them to be used in any level for disambiguating configuration keys.
zh_cn: YAML `null` 键不被包含在配置属性名称的程序集中，允许在任意级别使用它们来消除配置键的歧义。

source: YAML as a Configuration Source.
zh_cn: YAML 作为配置源。

source: Yep, it works in your Quarkus application, in your IDE, in your tests, because all of these are Quarkus applications. JTA has some bad press for some people. I don't know why. Let's just say that this is not your grandpa's JTA implementation. What we have is perfectly embeddable and lean.
zh_cn: 是的，它在你的Quarkus应用程序中，在你的IDE中，在你的测试中都可以使用，因为这些都是Quarkus应用程序。JTA对一些人来说有一些不好的影响。我不知道为什么。我们只能说，这不是老旧的JTA实现。我们所拥有的是完美的可嵌入的和精简的实现。

source: Yes
zh_cn: 是

source: Yes, we consider Quarkus stable. Remember 95% of the features Quarkus apps use are provided by the ecosystem like Hibernate ORM, Eclipse Vert.x, Netty, RESTEasy, etc. These libraries are rock solid :)
zh_cn: 是的，我们认为Quarkus是稳定的。请记住，Quarkus应用程序使用的95%的特性都是由Hibernate ORM, Eclipse Vert.x, Netty, RESTEasy等生态系统提供的。这些库是坚如磐石的 :)

source: You can `create` your function using the following command:
zh_cn: 你可以使用以下命令 `创建` 你的函数：

source: You can add a https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/Set-Cookie/SameSite[SameSite] cookie property to any of the cookies set by a Quarkus endpoint. For more information, see xref:http-reference.adoc#same-site-cookie[SameSite cookies].
zh_cn: 您可以在Quarkus终端设置的任何cookie中添加 link:https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/Set-Cookie/SameSite[SameSite] cookie属性的信息，请参见 link:http-reference.html#same-site-cookie[SameSite] 以了解更多信息。

source: You can add attributes by setting the `resource-attributes` tracer config that is described in the <<configuration-reference>>. Since this property can be overridden at runtime, the OpenTelemetry extension will pick up its value following the order of precedence that is described in the xref:config-reference.adoc#configuration_sources[Quarkus Configuration Reference].
zh_cn: 您可以通过设置 link:#configuration-reference[[参考设置]] 中的 `resource-attributes` tracer 配置来添加属性。由于这个属性可以在运行时被覆盖，OpenTelemetry扩展将按照 link:config-reference.html#configuration_sources[Quarkus参考配置] 中描述的优先顺序来获取其值。

source: You can add the `smallrye-reactive-messaging-kafka` extensions to your project by running the following command in your project base directory:
zh_cn: 您可以通过在您的项目根目录下运行以下命令来将 `smallrye-reactive-messaging-kafka` 扩展添加到您的项目中：

source: You can add the extension to your project using:
zh_cn: 你可以用以下方法将扩展添加到你的项目中：

source: You can also build the native executable using:
zh_cn: 您也可以用以下方法构建原生(native)可执行文件：

source: You can also create a native executable from this application without making any source code changes. A native executable removes the dependency on the JVM: everything needed to run the application on the target platform is included in the executable, allowing the application to run with minimal resource overhead.
zh_cn: 无需对源代码做任何修改，就可以将应用程序构建为一个本地可执行文件。本地可执行文件消除了对JVM的依赖，它包含了在目标平台上运行应用程序所需的一切，使应用程序能够以最小的资源开销运行。

source: You can also generate the native executable with:
zh_cn: 你也可以通过以下命令生成本地可执行文件:

source: You can also get the Kafka configuration injected to your application and create Kafka producer, consumer and admin clients directly:
zh_cn: 您也可以把Kafka配置注入到您的应用程序中来直接创建Kafka生产者，消费者以及管理客户端：

source: You can also just add the following dependency into your project:
zh_cn: 你也可以直接将以下依赖添加到你的项目中:

source: You can also package the application in a container.
zh_cn: 还可以将应用程序打包在容器中。

source: You can also pass any property supported by the underlying https://kafka.apache.org/documentation/#consumerconfigs[Kafka consumer].
zh_cn: 您也可以传递底层 link:https://kafka.apache.org/documentation/#consumerconfigs[Kafka消费者] 支持的任何属性。

source: You can also pass any property supported by the underlying https://kafka.apache.org/documentation/#producerconfigs[Kafka producer].
zh_cn: 您也可以传递底层 link:https://kafka.apache.org/documentation/#producerconfigs[Kafka生产者] 支持的任何属性。

source: You can also programmatically ask for a transaction to be marked for rollback. Inject a `TransactionManager` for this.
zh_cn: 你也可以使用编程方式要求一个事务被标记为回滚。为此需要注入 `TransactionManager` 。

source: You can also provide duration values starting with a number. In this case, if the value consists only of a number, the converter treats the value as seconds. Otherwise, `PT` is implicitly prepended to the value to obtain a standard `java.time.Duration` format.
zh_cn: 您还可以提供以数字开头的持续时间值。 在这种情况下，如果该值仅包含一个数字，则转换器将该值视为秒。 否则，`PT` 会隐式添加到值的前面，以获得标准的`java.time.Duration` 格式。

source: You can also remove the limit of in-flight messages by setting `max-inflight-messages` to `0`. However, note that the Kafka producer may block if the number of requests reaches `max.in.flight.requests.per.connection`.
zh_cn: 您也可以通过将 `max-inflight-messages` 设置为 `0` 来取消in-flight消息的限制。但请注意，如果请求数量达到 `max.in.flight.requests.per.connection` 指定的值，Kafka生产者可能会阻塞。

source: You can also return a `Uni<T>` or a `CompletionStage<T>` to handle asynchronous reply:
zh_cn: 你也可以返回一个 `Uni<T>` 或一个 `CompletionStage<T>` 来处理异步回复：

source: You can also run the test from your IDE directly (be sure you stopped the application first).
zh_cn: 你也可以直接从你的IDE中运行测试（要确保你先停止了应用程序）。

source: You can also use a local inlined public key for testing your `quarkus-oidc` `service` applications:
zh_cn: 你也可以使用一个本地内嵌的公钥来测试你的 `quarkus-oidc` `service` 应用程序:

source: You can also use it to customize the way the token is verified or decrypted. For example, one can supply a local `SecretKey`:
zh_cn: 你也可以用它来定制令牌的验证或解密方式。例如，可以提供一个本地 `SecretKey` ：

source: You can also write your queries in plain link:https://docs.jboss.org/hibernate/orm/5.4/userguide/html_single/Hibernate_User_Guide.html#hql[HQL]:
zh_cn: 你也可以用普通的 link:https://docs.jboss.org/hibernate/orm/5.4/userguide/html_single/Hibernate_User_Guide.html#hql[HQL] 编写查询语句：

source: You can apply asynchronous stream processing by consuming and returning reactive stream `Multi<T>` type:
zh_cn: 您可以通过消费和返回响应式流 `Multi<T>` 类型来应用异步流处理：

source: You can build a native executable with the usual command:
zh_cn: 你可以使用常用命令构建本机可执行文件：

source: You can build the native executable with:
zh_cn: 您可以使用以下命令构建本机可执行文件:

source: You can combine Reactive Messaging with https://github.com/smallrye/smallrye-fault-tolerance[SmallRye Fault Tolerance], and retry processing if it failed:
zh_cn: 您可以将Reactive Messaging与 link:https://github.com/smallrye/smallrye-fault-tolerance[SmallRye 容错]结合起来，如果失败的话可以进行重试：

source: You can configure the AMQP address using the `address` attribute:
zh_cn: 你可以使用 `address` 属性配置AMQP地址：

source: You can configure the Dev Services for Kafka to create topics once the broker is started. Topics are created with given number of partitions and 1 replica.
zh_cn: 您可以配置Kafka开发服务来在broker启动后创建主题。主题以给定的分区数量以及1个副本创建。

source: You can configure the Vert.x instance from the `application.properties` file. The following table lists the supported properties:
zh_cn: 你可以从 `application.properties` 文件中配置Vert.x实例。下表列出了支持的属性：

source: You can configure the `bootstrap.servers` for each channel using `mp.messaging.incoming|outgoing.$channel.bootstrap.servers` property. Default is `kafka.bootstrap.servers`.
zh_cn: 您可以使用 `mp.messaging.incoming|outgoing.$channel.bootstrap.servers` 属性为每个 channel 配置 `bootstrap.servers` 。默认是 `kafka.bootstrap.servers` 。

source: You can configure the default transaction timeout, the timeout that applies to all transactions managed by the transaction manager, via the property `quarkus.transaction-manager.default-transaction-timeout`, specified as a duration.
zh_cn: 你可以通过属性 `quarkus.transaction-manager.default-transaction-timeout` 来配置默认的事务超时，即适用于由事务管理器管理的所有事务的超时，指定为一个持续时间。

source: You can configure the delay, the number of retries, the jitter, etc.
zh_cn: 您可以对延迟，重试次数以及抖动(jitter)等处理方式进行设置。

source: You can configure the ports used by tests by configuring `quarkus.http.test-port` for HTTP and `quarkus.http.test-ssl-port` for HTTPS in your `application.properties`:
zh_cn: 您可以通过 `quarkus.http.test-port` 和 `quarkus.http.test-ssl-port` 来配置用于HTTP和HTTPS测试的端口：

source: You can configure timeout for Kafka admin client calls used in topic creation using `quarkus.kafka.devservices.topic-partitions-timeout`, it defaults to 2 seconds.
zh_cn: 您可以通过 `quarkus.kafka.devservices.topic-partitions-timeout` 来配置在主题创建中所使用的Kafka管理员客户端调用的超时时间，默认为2秒。

source: You can control whether and how the transaction is started with parameters on `@Transactional`:
zh_cn: 你可以通过 `@Transactional` 上的参数来控制是否以及如何启动事务：

source: You can customize the underlying client configuration by producing an instance of `AmqpClientOptions` as follows:
zh_cn: 你可以通过产生一个 `AmqpClientOptions` 的实例来定制底层的客户端配置，如下所示：

source: You can define your entity as regular POJO. You can add the `@MongoEntity` annotation to your entity if you need to customize the name of the collection, the database, or the client.
zh_cn: 你可以将你的实体定义为普通的POJO。如果你需要自定义集合、数据库或客户端的名称，你可以给你的实体添加 `@MongoEntity` 注解。

source: You can deploy _verticles_ in Quarkus. It supports:
zh_cn: 你可以在Quarkus中部署 _verticles_ 。它支持：

source: You can deploy your Lambda as a pure Java jar, or you can compile your project to a native image and deploy that for a smaller memory footprint and startup time. Our integration also generates SAM deployment files that can be consumed by https://docs.aws.amazon.com/serverless-application-model/latest/developerguide/what-is-sam.html[Amazon's SAM framework].
zh_cn: 你可以将你的Lambda部署为一个纯Java jar，或者你可以将你的项目编译为一个原生镜像，并以较少的内存占用和启动时间来部署。我们的集成还可以生成SAM部署文件，这些文件可以被 link:https://docs.aws.amazon.com/serverless-application-model/latest/developerguide/what-is-sam.html[亚马逊的SAM框架] 来使用。

source: You can detect the vulnerabilities at the application build time with an NVD feed by using the Maven link:https://jeremylong.github.io/DependencyCheck/dependency-check-maven/[OWASP Dependency check plugin].
zh_cn: 您可以通过使用Maven link:https://jeremylong.github.io/DependencyCheck/dependency-check-maven/[OWASP依赖性检查插件] 在应用构建时用NVD feed来检测漏洞。

source: You can disable measurement of HTTP endpoints using the `quarkus.micrometer.binder.http-server.ignore-patterns` property. This property accepts a comma-separated list of simple regex match patterns identifying URI paths that should be ignored. For example, setting `quarkus.micrometer.binder.http-server.ignore-patterns=/example/prime/[0-9]+` will ignore a request to `http://localhost:8080/example/prime/7919`. A request to `http://localhost:8080/example/gauge/7919` would still be measured.
zh_cn: 您可以使用 `quarkus.micrometer.binder.http-server.ignore-patterns` 属性禁用对HTTP节点的测量。这个属性接受一个用逗号分隔的简单正则表达式匹配的列表来识别应被忽略的URI路径。例如， `quarkus.micrometer.binder.http-server.ignore-patterns=/example/prime/[0-9]+` 会忽略对 `<a href="http://localhost:8080/example/prime/7919" class="bare">http://localhost:8080/example/prime/7919</a>` 请求的监测。而一个对 `<a href="http://localhost:8080/example/gauge/7919" class="bare">http://localhost:8080/example/gauge/7919</a>` 的请求仍会被监测。

source: You can do this with `io.quarkus.test.common.DevServicesContext`, which can be injected directly into any `@QuarkusTest` or `@QuarkusIntegrationTest`. All you need to do is define a field of type `DevServicesContext` and it will be automatically injected. Using this you can retrieve any properties that have been set. Generally this is used to directly connect to a resource from the test itself, e.g. to connect to kafka to send messages to the application under test.
zh_cn: 您可以使用 `io.quarkus.test.common.DevServicesContext` 来达到目的，它可以直接注入到任何 `@QuarkusTest` 或 `@QuarkusIntegrationTest` 中。您所需要做的就是定义一个类型为 `DevServicesContext` 的字段，然后它就会自动被注入。使用该方法，您可以检索到任何已经设置的属性。一般来说，这被用来直接连接到测试本身的资源，例如，连接到kafka来发送消息到被测试的应用程序。

source: You can find more information about all this in https://github.com/oracle/graal/blob/master/docs/reference-manual/native-image/ClassInitialization.md[the GraalVM documentation].
zh_cn: 你可以在 https://github.com/oracle/graal/blob/master/docs/reference-manual/native-image/ClassInitialization.md[GraalVM的文档]中找到更多关于这一切的信息。

source: You can find more information about how to configure the native image building process in the <<configuration-reference>> section below.
zh_cn: 你可以在下面的 <<configuration-reference>> 部分找到关于如何配置原生镜像构建过程的更多信息。

source: You can find more information about this feature in the xref:hibernate-orm.adoc#flyway[Hibernate ORM guide].
zh_cn: 你可以在xref:hibernate-orm.adoc#flyway[Hibernate ORM guide]找到更多相关信息。

source: You can find more information about this topic in https://github.com/oracle/graal/blob/master/docs/reference-manual/native-image/Resources.md[the GraalVM documentation].
zh_cn: 你可以在 https://github.com/oracle/graal/blob/master/docs/reference-manual/native-image/Resources.md[GraalVM文档]中找到更多关于这个主题的信息。

source: You can find the extension status on https://code.quarkus.io[code.quarkus.io] or in the extension link:/guides/[guides].
zh_cn: 您可以在 https://code.quarkus.io[code.quarkus.io] 或在扩展 link:/guides/[手册]中找到扩展状态。

source: You can get a better understanding on how to use this extension in the Quarkus Guides.
zh_cn: 你可以在Quarkus指南中更好地了解如何使用这个扩展。

source: You can go to https://code.quarkus.io/[code.quarkus.io] to see if a particular extension is _stable_ (default) or _preview_.
zh_cn: 您可以访问 https://code.quarkus.io/[code.quarkus.io] 查看特定扩展是否为 _stable_ (默认) or _preview_。

source: You can have your projection class extends from another class. In this case, the parent class also needs to have use `@ProjectionFor` annotation.
zh_cn: 你可以让你的映射类从另一个类继承。在这种情况下，父类也需要有使用 `@ProjectionFor` 注解。

source: You can inject an `executor` if you use the Context Propagation extension:
zh_cn: 如果你使用Context Propagation扩展，你可以注入一个 `executor` ：

source: You can inject either the:
zh_cn: 你也可以这样注入：

source: You can now interact with your REST service:
zh_cn: 现在你可以与你的REST服务进行交互：

source: You can of course create a native image using the instructions of the xref:building-native-image.adoc[Building a native executable guide].
zh_cn: 当然，你也可以使用 link:building-native-image.html[构建本地可执行文件指南] 的说明来创建一个本地镜像。

source: You can override the configuration by adding the following lines to the `application.properties`:
zh_cn: 您可以通过在 `application.properties` 中添加以下属性来覆盖配配置：

source: You can override the profile the executable *runs* with during the test using the `quarkus.test.native-image-profile` property. Either by adding it to `application.properties` or by appending it to the command line: `./mvnw verify -Pnative -Dquarkus.test.native-image-profile=test`. Your `%test.` prefixed properties will be used at the test runtime.
zh_cn: 可以在可执行文件 *运行* 测试期间覆盖配置文件的 `quarkus.test.native-image-profile` 属性。可以添加到 `application.properties` ，或将其附加到命令行，如： `./mvnw verify -Pnative -Dquarkus.test.native-image-profile=test`。您的 `%test.` 前缀属性将在测试运行时使用。

source: You can override the profile the executable is *built* with and *runs* with using the `quarkus-profile=test` property, e.g. `./mvnw clean verify -Pnative -Dquarkus-profile=test`. This might come handy if there are test specific resources to be processed, such as importing test data into the database.
zh_cn: 可以使用 `quarkus-profile=test` 属性覆盖可执行文件 *built* 和 *runs* 的配置文件。例如 `./mvnw clean verify -Pnative -Dquarkus-profile=test`。如果要处理特定于测试的资源，例如将测试数据导入数据库，那么这可能会很方便。

source: You can pass query parameters by index (1-based) as shown below:
zh_cn: 你可以通过索引（从1开始）传递查询参数，如下所示：

source: You can pass query parameters, for both native and PanacheQL queries, by index (1-based) as shown below:
zh_cn: 对于原生和PanacheQL查询，你可以通过索引（基于1）传递查询参数，如下所示：

source: You can provide custom options for the `native-image` command using the `<quarkus.native.additional-build-args>` property. Multiple options may be separated by a comma.
zh_cn: 你可以使用 `<quarkus.native.additional-build-args>` 属性为 `native-image` 命令提供自定义选项。多个选项可以用逗号隔开。

source: You can put all your JPA column annotations on the public fields. If you need a field to not be persisted, use the `@Transient` annotation on it. If you need to write accessors, you can:
zh_cn: 这些公共字段可以添加任何JPA列注解。如果你不想持久化某个字段，给它增加 `@Transient` 注解即可。如果你需要编写访问器，可以：

source: You can read more about UBI images on:
zh_cn: 你可以在这里阅读更多关于UBI镜像的内容：

source: You can receive it using a `JsonObject`
zh_cn: 你可以使用 `JsonObject` 接收它

source: You can reference a named query instead of a (simplified) HQL query by prefixing its name with the '#' character. You can also use named queries for count, update and delete queries.
zh_cn: 除了上述的简化HQL查询以外，你还可以定义一个命名查询，然后通过'#'字符加命名来（在HQL中）引用它。在计数、更新和删除查询中也可以使用命名查询。

source: You can restore the default behavior of Jackson by setting `quarkus.jackson.fail-on-unknown-properties=true` in your `application.properties` or on a per class basis via `@JsonIgnoreProperties(ignoreUnknown = false)`.
zh_cn: 你可以通过在你的 `application.properties` ，或者通过 `@JsonIgnoreProperties(ignoreUnknown = false)` ，在每个类的基础上设置 `quarkus.jackson.fail-on-unknown-properties=true` ，恢复Jackson的默认行为。

source: You can return _reactive types_ to handle asynchronous processing. Quarkus recommends the usage of https://smallrye.io/smallrye-mutiny[Mutiny] to write reactive and asynchronous code.
zh_cn: 你可以返回 _响应式类型_ 来处理异步处理。Quarkus推荐使用 link:https://smallrye.io/smallrye-mutiny[Mutiny] 来编写响应式和异步代码。

source: You can run the application as a conventional jar file.
zh_cn: 你可以将应用打包为一个传统的jar文件，然后运行。

source: You can run the application in a container using the JAR produced by the Quarkus Maven Plugin. However, in this section we focus on creating a container image using the produced native executable.
zh_cn: 你可以使用Quarkus Maven插件生成的JAR在容器中运行该应用程序。然而，在本节中我们将重点讨论使用生成的原生可执行文件创建一个容器镜像。

source: You can run the application using: `java -jar target/quarkus-app/quarkus-run.jar`
zh_cn: 你可以用以下方式运行该应用程序。 `java -jar target/quarkus-app/quarkus-run.jar`

source: You can run these using Maven:
zh_cn: 你可以用Maven来运行这些：

source: You can set a https://github.com/open-telemetry/opentelemetry-specification/blob/main/specification/trace/sdk.md#built-in-samplers[built-in sampler] simply by setting the desired sampler config described in the <<configuration-reference>>.
zh_cn: 您可以通过设置 link:#configuration-reference[[参考配置]] 中提到的必要的采样器配置来简单地设置一个 link:https://github.com/open-telemetry/opentelemetry-specification/blob/main/specification/trace/sdk.md#built-in-samplers[内置采样器]。

source: You can specify your own ID strategy by extending `PanacheEntityBase` instead of `PanacheEntity`. Then you just declare whatever ID you want as a public field:
zh_cn: 你可以通过继承 `PanacheEntityBase` ，而非 `PanacheEntity` ，来指定你自己的ID策略。然后只要把你想要的ID字段声明为public字段：

source: You can specify your own ID strategy by extending `PanacheMongoEntityBase` instead of `PanacheMongoEntity`. Then you just declare whatever ID you want as a public field by annotating it by `@BsonId`:
zh_cn: 你可以通过继承 `PanacheMongoEntityBase` ，而不是 `PanacheMongoEntity` ，来指定你自己的ID策略。然后你只要通过 `@BsonId` ，将你想要的任何ID声明为一个公共字段。

source: You can test the application launched in JVM or Native modes with `curl`.
zh_cn: 您可以用 `curl` 测试在JVM或Native模式下启动的应用程序。

source: You can the use the `io.quarkus.test.common.http.TestHTTPEndpoint` annotation to specify the endpoint path, and the path will be extracted from the provided endpoint. If you also specify a value for the `TestHTTPResource` endpoint it will be appended to the end of the endpoint path.
zh_cn: 您可以使用 `io.quarkus.test.common.http.TestHTTPEndpoint` 注释来指定节点路径，该路径会从提供的节点中提取。如果您还为 `TestHTTPResource` 节点指定了另外的值，它将被附加到节点路径后。

source: You can then build a native executable with the usual command:
zh_cn: 然后你可以用常用的命令构建一个本地可执行文件：

source: You can then point your browser to `http://localhost:8080/fruits.html` and use your application.
zh_cn: 然后你可以使用的浏览器访问 `<a href="http://localhost:8080/fruits.html" class="bare">http://localhost:8080/fruits.html</a>` 来使用你的应用程序。

source: You can then test the executable locally with sam local
zh_cn: 然后你可以使用sam local在本地测试可执行文件

source: You can update the Java code as you see fit. Once you've rebuilt, you can redeploy your lambda by executing the `update` command.
zh_cn: 你可以在你认为合适的时候更新Java代码。一旦你重建了，你可以通过执行 `update` 命令来重新部署你的lambda。

source: You can use `@TestSecurity` and `@OidcSecurity` annotations for testing the `service` application endpoint code which depends on the injected `JsonWebToken` as well as `UserInfo` and `OidcConfigurationMetadata`.
zh_cn: 你可以使用 `@TestSecurity` 和 `@OidcSecurity` 注解来测试 `service` 应用程序端点代码，该代码依赖于注入的 `JsonWebToken` 以及 `UserInfo` 和 `OidcConfigurationMetadata` 。

source: You can use `Uni` and `Response` to return asynchronous HTTP responses: `Uni<Response>`.
zh_cn: 您可以使用 `Uni` 和 `Response` 返回异步 HTTP 响应：`Uni<Response>`。

source: You can use a configuration file to register classes for reflection.
zh_cn: 你可以使用一个配置文件来为反射注册类。

source: You can use any of the Quarkus features in your function and benefit from the fast startup and low memory utilization. With Quarkus, you can embrace this new world without having to change your programming language.
zh_cn: 您可以在函数中使用任何Quarkus特性，并受益于快速启动和低内存利用率。使用Quarkus，您无需改变编程语言就可以拥抱这个新世界。

source: You can use it to restrict which fields will be returned by the database, the ID field will always be returned, but it's not mandatory to include it inside the projection class.
zh_cn: 你可以用它来限制哪些字段将被数据库返回，ID字段将始终被返回，但并不强制要求在映射类中包含它。

source: You can use it to restrict which fields will be returned by the database.
zh_cn: 你可以用投影限制数据库返回哪些字段。

source: You can use public fields or private fields with getters/setters. If you don't want to manage the ID by yourself, you can make your entity extends `PanacheMongoEntity`.
zh_cn: 你可以使用公共字段或带有getters/setters的私有字段。如果你不想自己管理ID，你可以让你的实体继承 `PanacheMongoEntity` 。
